ninety_nine_cats/app/controllers/cats_controller.rb

    def create
        @new_cat = Cat.new(cat_params)
        if @new_cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Golden State Warriors"], ["updated_at", "2020-11-01 23:43:52.386213"], ["id", 201]]